emacs/.emacs.d/synthmacs/synthmacs-ui.el
;; [[file:../synthmacs.org::*Themes][Themes:1]]
