emacs/.emacs.d/synthmacs.org
** Themes
:PROPERTIES:
:CUSTOM_ID: h:07174251-A9E9-47E8-8AF3-AD5013CAC793
:END:
#+begin_src emacs-lisp
(use-package doom-themes
  :config
  ;; Global settings (defaults)


  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled


  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)

  ;; or for treemacs users
  (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
  (doom-themes-treemacs-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(use-package afternoon-theme)
(use-package alect-themes)
(use-package ample-theme)
(use-package ample-zen-theme)
(use-package badwolf-theme)
(use-package catppuccin-theme)
(use-package clues-theme)
(use-package color-theme-sanityinc-solarized)
(use-package color-theme-sanityinc-tomorrow)
(use-package cyberpunk-theme)
(use-package darktooth-theme)
(use-package flatland-theme)
(use-package gruvbox-theme)
(use-package jazz-theme)
(use-package kaolin-themes)
(use-package material-theme)
(use-package modus-themes)
(use-package monokai-theme)
(use-package seti-theme)
(use-package soothe-theme)
(use-package subatomic-theme)
(use-package sublime-themes)

(use-package solaire-mode
  :init
  (solaire-global-mode +1))


;;; Functions:
(defvar synthmacs--fallback-theme 'kaolin-bubblegum
  "Fallback theme if user theme cannot be applied.")

(defvar synthmacs--cur-theme nil
  "Internal variable storing currently loaded theme.")

(defvar synthmacs--user-themes '(kaolin-bubblegum
				 doom-challenger-deep
				 cyberpunk
				 jazz
				 afternoon
				 ample-zen
				 doom-1337
				 catppuccin
				 manoj-dark
				 doom-snazzy
				 kaolin-dark
				 doom-gruvbox
				 doom-old-hope
				 kaolin-aurora
				 doom-acario-dark
				 gruvbox-dark-hard
				 modus-vivendi
				 alect-black
				 modus-operandi
				 gruvbox-light-hard))

(defun synthmacs/load-theme (&optional theme)
  "Apply user theme."
  (if theme
      (progn
	(load-theme theme t)
	(setq-default synthmacs--cur-theme theme))
    (progn
      (load-theme synthmacs--fallback-theme t)
      (setq-default spacemacs--cur-theme synthmacs--fallback-theme))))

(defun synthmacs/load-random-theme ()
  (interactive)
  (let* ((size (length synthmacs--user-themes))
         (index (random size))
         (randomTheme (nth index synthmacs--user-themes)))
    (synthmacs/load-theme randomTheme)))

(defun synthmacs/cycle-synthmacs-theme (&optional backward)
  "Cycle through themes defined in `synthmacs-themes'.
When BACKWARD is non-nil, or with universal-argument, cycle backwards."
  (interactive "P")
  (let* (
	 ;; (theme-names (mapcar 'synthmacs--user-themes)
         (themes (if backward
		     (reverse synthmacs--user-themes)
		   synthmacs--user-themes))
         (next-theme
	  (car (or (cdr (memq synthmacs--cur-theme themes))
		   ;; if current theme isn't in cycleable themes, start
		   ;; over
		   themes))))
    (when synthmacs--cur-theme
      (disable-theme synthmacs--cur-theme))
    (let ((progress-reporter
           (make-progress-reporter
            (format "Loading theme %s..." next-theme))))
      (synthmacs/load-theme next-theme)
      (progress-reporter-done progress-reporter))))

(defun synthmacs/cycle-synthmacs-theme-backward ()
  "Cycle through themes defined in `dotsynthmacs-themes' backward."
  (interactive)
  (synthmacs/cycle-synthmacs-theme t))

(synthmacs/leader-keys
  "tt" '(:ignore t :wk "themes")
  "ttn" '(synthmacs/hydra-theme-cycle :wk "cycle-themes")
  "ttN" '(synthmacs/hydra-theme-cycle-backward :wk "cycle-themes-backwards")
  "ttr" '(synthmacs/hydra-theme-random :wk "random-theme"))

(defun synthmacs/hydra-theme-cycle ()
  (interactive)
  (synthmacs/cycle-synthmacs-theme)
  (synthmacs/hydra/cycle-themes/body))

(defun synthmacs/hydra-theme-cycle-backward ()
  (interactive)
  (synthmacs/cycle-synthmacs-theme t)
  (synthmacs/hydra/cycle-themes/body))

(defun synthmacs/hydra-theme-random ()
  (interactive)
  (synthmacs/load-random-theme)
  (synthmacs/hydra/cycle-themes/body))

(defhydra synthmacs/hydra/cycle-themes (:timeout 20)
  "
^Themes Menu
^^^^^^^^------------------------
[_n_]     cycle-theme
[_p_/_N_]   cycle-theme-backward
[_r_]     random-theme
[_q_] quit
"
  ("n" synthmacs/cycle-synthmacs-theme)
  ("p" synthmacs/cycle-synthmacs-theme-backward)
  ("N" synthmacs/cycle-synthmacs-theme-backward)
  ("r" synthmacs/load-random-theme)
  ("q" nil :exit t))

(synthmacs/load-random-theme)

#+end_src
* Completion framework
:PROPERTIES:
:CUSTOM_ID: h:FB3661CB-A573-40B6-B331-449D77DBD199
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-completion-framework.el
:END:
* Useful Tools
:PROPERTIES:
:CUSTOM_ID: h:B57C03F6-2111-489A-9303-B1A06C95EFF5
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-tools.el
:END:

** WS-Butler
:PROPERTIES:
:CUSTOM_ID: h:C8E39F4E-D75F-4031-8205-F1A7F865B91A
:END:
#+begin_src emacs-lisp
(use-package ws-butler
  :init
  ;; (ws-butler-global-mode 1)
  (add-hook 'prog-mode-hook #'ws-butler-mode))
#+end_src

* Programming Environment
:PROPERTIES:
:CUSTOM_ID: h:2E967F87-8304-4262-B5BF-3286ACA7211B
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-programming.el
:END:

* Programming Languages
:PROPERTIES:
:CUSTOM_ID: h:732BA080-834D-49E0-967E-0D37CE1C6BA0
:END:

** Clojure
:PROPERTIES:
:CUSTOM_ID: h:FF09BB1E-5437-4AFF-A4F5-367B92AF76CC
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-clojure.el
:END:
** Haskell
:PROPERTIES:
:CUSTOM_ID: h:28BA5E9F-6893-4E40-9F42-246F8731948C
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-haskell.el
:END:
** HTML
:PROPERTIES:
:CUSTOM_ID: h:5561B91C-C61D-47D5-8320-9A559032C762
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-html.el
:END:
** LISP
:PROPERTIES:
:CUSTOM_ID: h:2171FA3F-D9BC-4058-9442-6827BABFC2CE
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-lisp.el
:END:
** Markdown
:PROPERTIES:
:CUSTOM_ID: h:80E9702A-E2B6-44B5-A139-AD16C9B5D92F
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-markdown.el
:END:
** Rust
:PROPERTIES:
:CUSTOM_ID: h:6355CFE4-6BA5-4134-BA38-74634F9FF919
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-rust.el
:END:
** Swift
:PROPERTIES:
:CUSTOM_ID: h:4C66614A-ED5B-4771-96C3-E2C789282DC1
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-swift.el
:END:
** YAML
:PROPERTIES:
:CUSTOM_ID: h:0AB88184-7AE8-4232-B4A7-B8C4714B91D3
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-yaml.el
:END:
* Provide modules
:PROPERTIES:
:CUSTOM_ID: h:754DFB20-B2AB-4750-9BDA-D24E8014C504
:END:

** synthmacs-core
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-core.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-core)
;;; synthmacs-core.el ends here
#+end_src

** synthmacs-package-management
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-package-management.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-package-management)
;;; synthmacs-package-management.el ends here
#+end_src

** synthmacs-general-evil
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-general-evil.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-general-evil)
;;; synthmacs-general-evil.el ends here
#+end_src

** synthmacs-org
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-org.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-org)
;;; synthmacs-org.el ends here
#+end_src

** synthmacs-ui
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-ui.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-ui)
;;; synthmacs-ui.el ends here
#+end_src

** synthmacs-completion-framework
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-completion-framework.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-completion-framework)
;;; synthmacs-completion-framework.el ends here
#+end_src

** synthmacs-tools
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-tools.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-tools)
;;; synthmacs-tools.el ends here
#+end_src

** synthmacs-programming
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-programming.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-programming)
;;; synthmacs-programming.el ends here
#+end_src

** Programming Languages
:PROPERTIES:
:CUSTOM_ID: h:320148C4-896F-4FFF-90CD-08E91DCCED9E
:END:

*** synthmacs-lang-clojure
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-clojure.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-clojure)
;;; synthmacs-lang-clojure.el ends here
#+end_src

*** synthmacs-lang-haskell
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-haskell.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-haskell)
;;; synthmacs-lang-haskell.el ends here
#+end_src

*** synthmacs-lang-html
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-html.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-html)
;;; synthmacs-lang-html.el ends here
#+end_src

*** synthmacs-lang-lisp
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-lisp.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-lisp)
;;; synthmacs-lang-lisp.el ends here
#+end_src

*** synthmacs-lang-markdown
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-markdown.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-markdown)
;;; synthmacs-lang-markdown.el ends here
#+end_src

*** synthmacs-lang-rust
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-rust.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-rust)
;;; synthmacs-lang-rust.el ends here
#+end_src

*** synthmacs-lang-swift
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-swift.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-swift)
;;; synthmacs-lang-swift.el ends here
#+end_src

*** synthmacs-lang-yaml
:PROPERTIES:
:CUSTOM_ID: h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-yaml.el
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-yaml)
;;; synthmacs-lang-yaml.el ends here
#+end_src

